# ТЕСТИРОВАНИЕ

# Тестирование, это написание тестового кода, который проверяет ошибки (bugs/баги) в нашем коде
# Это код, написанный для проверки другого кода на наличие ошибок.
# Тестировщик, это отдельная специальность, но программисты тоже должны знать, как тестировать код.
# Некоторые разработчики не очень любят писать тесты. Это связано с тем, что тесты задерживают разработку
# самих приложений, так как на код в 10 строчек надо написаь тест в десять строчек, если не больше.
# Но, тем не менее, эта задержка окупается сторицей. Особенно, если вы пишите приложеня не для себя,
# а для других пользователей, для продакшина.
# При помощи написания теста вы можете отловить ошибки на раннем этапе, еще до того, как эту ошибку
# заметит пользователь. Поэтому важно знать, как можно тесировать код.