# Внешние модули

# Это файлы, написаные на языке Пайтон другими программистами и размещенные на серверах сети интернет.
# То есть, вы можете скачать пакет этих файлов и воспользоваться ими для имплементации какой-то функциональности
# в вашем приложении.

# Если набрать в Гугле поисковый запрос: 'python external modules and packages'
# в выдаче можно найти ссылку на сайт: pypi.org - PyPi - the Python Package Index
# На этом сайте находятся самые различные пакеты с их описанием, которые вы можете установить у себя
# и воспользоваться ф-ями из модулей этих пакетов. На момент конспектирования этой лецкции, на этом сайте
# находится 227,481 projects/пакетов. Это пакеты от очень каки-то странных и смешных, до очень высокотехнологичных
# и направленных в какую-то узкую нишу.
# Перейдя по ссылке browse projects, переходим на страницу, где они классифицируются при помощи различых фильтров.
# Там можно либо ввести запрос на поиск какого-то пакета, либо выбрать фильтр из списка классификаторов.
# Нам будут доступны различные пакеты, в которых содержатся модули сразными ф-ями, которые можно использовать
# в вашем коде.
# Если у вас есть какая-то задача и вы найдете в Гугле, что вам нужен какой-то пакет, модуль, чтобы решить эту задачу,
# вы можете найти этот пакет на данном сайте, а не создавать его самостоятельно и тратить на это свое время.


